In [1]:
import pandas as pd
import numpy as np

In [2]:
my_data = np.array ([[10,20,30] , [20,30,40], [20,50,10], [10,15,20]])

In [3]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [4]:
my_name = ["Lewis" , "Yusuf_Ali", "Max", "James"]

In [5]:
my_colmuns = ["Jan", "Feb", "Mar"]

In [6]:
my_data_frame = pd.DataFrame(my_data)

In [7]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  20

In [8]:
type(my_data_frame)

pandas.core.frame.DataFrame

In [9]:
my_data_frame[1]

0    20
1    30
2    50
3    15
Name: 1, dtype: int64

In [10]:
new_data_frame = pd.DataFrame(my_data, index=my_name, columns=my_colmuns)

In [11]:
new_data_frame

           Jan  Feb  Mar
Lewis       10   20   30
Yusuf_Ali   20   30   40
Max         20   50   10
James       10   15   20

In [12]:
new_data_frame["Feb"]

Lewis        20
Yusuf_Ali    30
Max          50
James        15
Name: Feb, dtype: int64

In [13]:
type(new_data_frame["Feb"])

pandas.core.series.Series

In [14]:
feb_series = new_data_frame["Feb"]

In [15]:
feb_series.mean()

np.float64(28.75)

In [16]:
feb_series.Lewis

np.int64(20)

In [17]:
feb_series.Yusuf_Ali

np.int64(30)

In [18]:
feb_series.max()

50

In [19]:
new_data_frame["Jan"].mean()

np.float64(15.0)

In [20]:
new_data_frame

           Jan  Feb  Mar
Lewis       10   20   30
Yusuf_Ali   20   30   40
Max         20   50   10
James       10   15   20

In [21]:
new_data_frame[["Jan","Feb"]]

           Jan  Feb
Lewis       10   20
Yusuf_Ali   20   30
Max         20   50
James       10   15

In [22]:
new_data_frame.loc["Lewis"]

Jan    10
Feb    20
Mar    30
Name: Lewis, dtype: int64

In [23]:
type(new_data_frame.loc["Lewis"])

pandas.core.series.Series

In [24]:
new_data_frame.loc["Lewis"].mean()

np.float64(20.0)

In [25]:
new_data_frame.iloc[3]

Jan    10
Feb    15
Mar    20
Name: James, dtype: int64

In [26]:
new_data_frame["Apr"] = new_data_frame["Mar"] * 2

In [27]:
new_data_frame

           Jan  Feb  Mar  Apr
Lewis       10   20   30   60
Yusuf_Ali   20   30   40   80
Max         20   50   10   20
James       10   15   20   40

In [28]:
# axis=0    ------>    row
# axis=1    ------>    colums


new_data_frame.drop("Lewis", axis = 0)

           Jan  Feb  Mar  Apr
Yusuf_Ali   20   30   40   80
Max         20   50   10   20
James       10   15   20   40

In [29]:
new_data_frame.drop("Mar", axis=1)

           Jan  Feb  Apr
Lewis       10   20   60
Yusuf_Ali   20   30   80
Max         20   50   20
James       10   15   40

In [30]:
new_data_frame

           Jan  Feb  Mar  Apr
Lewis       10   20   30   60
Yusuf_Ali   20   30   40   80
Max         20   50   10   20
James       10   15   20   40

In [31]:
# inplace  ---> icinde yap demektir ve true ise evet der ve o matrix oyle kaydedilir
new_data_frame.drop("Mar", axis=1, inplace=True)

In [32]:
new_data_frame

           Jan  Feb  Apr
Lewis       10   20   60
Yusuf_Ali   20   30   80
Max         20   50   20
James       10   15   40

In [33]:
new_data_frame["Jan"].Lewis

np.int64(10)

In [34]:
new_data_frame["Jan"]["Lewis"]

np.int64(10)

In [35]:
new_data_frame

           Jan  Feb  Apr
Lewis       10   20   60
Yusuf_Ali   20   30   80
Max         20   50   20
James       10   15   40

In [36]:
boolean_frame = new_data_frame > 25

In [37]:
boolean_frame

             Jan    Feb    Apr
Lewis      False  False   True
Yusuf_Ali  False   True   True
Max        False   True  False
James      False  False   True

In [38]:
new_data_frame[boolean_frame]

           Jan   Feb   Apr
Lewis      NaN   NaN  60.0
Yusuf_Ali  NaN  30.0  80.0
Max        NaN  50.0   NaN
James      NaN   NaN  40.0

In [39]:
new_data_frame[new_data_frame > 30]

           Jan   Feb   Apr
Lewis      NaN   NaN  60.0
Yusuf_Ali  NaN   NaN  80.0
Max        NaN  50.0   NaN
James      NaN   NaN  40.0

In [43]:
new_data_frame[new_data_frame["Apr"] > 50]

           Jan  Feb  Apr
Lewis       10   20   60
Yusuf_Ali   20   30   80

In [44]:
new_data_frame

           Jan  Feb  Apr
Lewis       10   20   60
Yusuf_Ali   20   30   80
Max         20   50   20
James       10   15   40

In [48]:
new_data_frame.iloc[0]

Jan    10
Feb    20
Apr    60
Name: Lewis, dtype: int64

In [49]:
new_data_frame.reset_index()

       index  Jan  Feb  Apr
0      Lewis   10   20   60
1  Yusuf_Ali   20   30   80
2        Max   20   50   20
3      James   10   15   40

In [50]:
new_data_frame

           Jan  Feb  Apr
Lewis       10   20   60
Yusuf_Ali   20   30   80
Max         20   50   20
James       10   15   40

In [51]:
new_data_frame["NewIndex"] = ["Ham", "Okc", "Alo", "Ver"]

In [52]:
new_data_frame

           Jan  Feb  Apr NewIndex
Lewis       10   20   60      Ham
Yusuf_Ali   20   30   80      Okc
Max         20   50   20      Alo
James       10   15   40      Ver

In [53]:
new_data_frame.set_index("NewIndex")

          Jan  Feb  Apr
NewIndex
Ham        10   20   60
Okc        20   30   80
Alo        20   50   20
Ver        10   15   40

In [54]:
new_data_frame

           Jan  Feb  Apr NewIndex
Lewis       10   20   60      Ham
Yusuf_Ali   20   30   80      Okc
Max         20   50   20      Alo
James       10   15   40      Ver

In [55]:
new_data_frame.drop("NewIndex", axis = 1, inplace= True)

In [56]:
new_data_frame

           Jan  Feb  Apr
Lewis       10   20   60
Yusuf_Ali   20   30   80
Max         20   50   20
James       10   15   40